using Application.Dto.Request;
using Application.Interfaces.Service;

namespace Application.Services;

public class SendEmailService:ISendEmailService
{
    public void sendEmailWelcome(string nome, string email)
    {
        Console.ForegroundColor = ConsoleColor.Magenta;
        
        Console.WriteLine($@"
____________________________________________________________________________________________
        email-from: no-replay@fgc.com.br
        email-to:{email}

        ███████╗██╗ █████╗ ██████╗     ██████╗██╗      ██████╗ ██╗   ██╗██████╗ 
        ██╔════╝██║██╔══██╗██╔══██╗   ██╔════╝██║     ██╔═══██╗██║   ██║██╔══██╗
        █████╗  ██║███████║██████╔╝   ██║     ██║     ██║   ██║██║   ██║██║  ██║
        ██╔══╝  ██║██╔══██║██╔═══╝    ██║     ██║     ██║   ██║██║   ██║██║  ██║
        ██║     ██║██║  ██║██║        ╚██████╗███████╗╚██████╔╝╚██████╔╝██████╔╝
        ╚═╝     ╚═╝╚═╝  ╚═╝╚═╝         ╚═════╝╚══════╝ ╚═════╝  ╚═════╝ ╚═════╝ 
        ");
        
        Console.ForegroundColor = ConsoleColor.Cyan;
        
        Console.WriteLine(@"
         ██████╗  █████╗ ███╗   ███╗███████╗
        ██╔════╝ ██╔══██╗████╗ ████║██╔════╝
        ██║  ███╗███████║██╔████╔██║█████╗  
        ██║   ██║██╔══██║██║╚██╔╝██║██╔══╝  
        ╚██████╔╝██║  ██║██║ ╚═╝ ██║███████╗
         ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝
        ");
        
        Console.ResetColor();
        
        Console.WriteLine($@"
        Olá! {nome}
        
        Seja muito bem-vindo(a) ao FIAP Cloud Game 
        Suca conta foi criada com sucesso, clique aqui  para
        definir a sua senha.
        
        Equipe FIAP
____________________________________________________________________________________________
        ");

    }


    public void sendEmaiPayment(PaymentStatusDto payment)
    {
        Console.WriteLine($@"
========================================================
        Informação DE PAGAMENTO
========================================================

Olá!

Seu pagamento foi **processado**!

📄 Detalhes da transação:
- Status: ${payment.Status.ToString()}
- Forma de pagamento: Cartão de Crédito
- Valor: R$ ${payment.Order.Price}
- Data: ${DateTime.Now}


Se tiver qualquer dúvida, estamos à disposição.

Obrigado por confiar em nós!

Atenciosamente,
Equipe FIAP Cloud Game
========================================================
");

    }
}